cf/Documents/КорректировкаДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаДолга</Name>
			<BasedOn>
				<xr:Item>Document.ОтгрузкаТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоОтгрузкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДолгДоКорректировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтношений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормаОтношений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоПартнеруСписком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартнерыСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияПереданныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоПартнеру</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОтношений</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормаОтношений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОтгрузки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияПереданныхТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Enums/ФормаОтношений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ФормаОтношений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ВидыОперацийВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/КорректировкаДолга/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	// ПАРАМЕТРЫ СИСТЕМЫ
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	|" + ?(Ссылка.ПоПартнеруСписком,"
	
	// ВЗАИМОРАСЧЕТЫ
	
	|ВЫБРАТЬ
	|	Ссылка.Дата			Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	Организация			Организация,
	|	Партнер				Партнер,
	|	Контрагент			Контрагент,
	|   ФормаОтношений,
	|   Сумма,
	|	СуммаУпр
	|ИЗ
	|	Документ.КорректировкаДолга.ПоПартнеру
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	(Сумма <> 0 ИЛИ СуммаУпр <> 0)
	|;
	
	// Долги по отгрузкам
	
	|ВЫБРАТЬ
	|	Ссылка.Дата			Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	Организация			Организация,
	|	Партнер				Партнер,
	|	Контрагент			Контрагент,
	|	Заказ			    Заказ,
	|	ДокументОтгрузки	ДокументОтгрузки,
	|   СуммаУпр			Сумма
	|ИЗ
	|	Документ.КорректировкаДолга.ПоПартнеру
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	(Сумма <> 0 ИЛИ СуммаУпр <> 0) И
	|	ФормаОтношений = Значение(Перечисление.ФормаОтношений.Клиент)
	
	//----------------------по одному-----------------------------
	|","
	
	// ВЗАИМОРАСЧЕТЫ
	
	|ВЫБРАТЬ
	|	Дата				Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	Организация			Организация,
	|	Партнер				Партнер,
	|	Контрагент			Контрагент,
	|   ФормаОтношений,
	|   Сумма				Сумма,
	|	СуммаУпр			СуммаУпр
	|ИЗ
	|	Документ.КорректировкаДолга
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
		
	// Долги по отгрузкам
	
	|ВЫБРАТЬ
	|	Дата			Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	Организация			Организация,
	|	Партнер				Партнер,
	|	Контрагент			Контрагент,
	|	Заказ			    Заказ,
	|	ДокументОтгрузки	ДокументОтгрузки,
	|   СуммаУпр			Сумма
	|ИЗ
	|	Документ.КорректировкаДолга
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	ФормаОтношений = Значение(Перечисление.ФормаОтношений.Клиент)
	|"));
	
	
	//СуммаОперации = Ссылка.Сумма - Ссылка.ДолгДоКорректировки;
	
	
	Запрос.УстановитьПараметр("ВидОперацииКорректировка",	Перечисления.ВидыОперацийВзаиморасчетов.Корректировка);
	//Запрос.УстановитьПараметр("СуммаОперации",				СуммаОперации);
	Запрос.УстановитьПараметр("Ссылка", 					Ссылка);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 			ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("Взаиморасчеты", 	Пакет[1].Выгрузить());
	ДополнительныеСвойства.Вставить("ДолгиПоОтгрузкам", 	Пакет[2].Выгрузить());
	
	
КонецПроцедуры
